Log/220705_163809_fio.log
/dev/nvme0n1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 2 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=21974: Tue Jul  5 16:38:19 2022
  read: IOPS=221k, BW=862MiB/s (903MB/s)(8617MiB/10001msec)
    slat (nsec): min=1680, max=315950, avg=2810.28, stdev=1954.01
    clat (usec): min=9, max=8537, avg=141.80, stdev=84.43
     lat (usec): min=12, max=8550, avg=144.66, stdev=84.51
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   65], 10.00th=[   73], 20.00th=[   83],
     | 30.00th=[   93], 40.00th=[  105], 50.00th=[  121], 60.00th=[  139],
     | 70.00th=[  159], 80.00th=[  192], 90.00th=[  243], 95.00th=[  297],
     | 99.00th=[  420], 99.50th=[  474], 99.90th=[  586], 99.95th=[  644],
     | 99.99th=[  775]
   bw (  KiB/s): min=820064, max=896040, per=50.03%, avg=882247.58, stdev=18365.42, samples=19
   iops        : min=205016, max=224012, avg=220562.00, stdev=4591.36, samples=19
  lat (usec)   : 10=0.01%, 20=0.34%, 50=2.73%, 100=33.09%, 250=54.66%
  lat (usec)   : 500=8.83%, 750=0.33%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=31.85%, sys=61.93%, ctx=119880, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=2205965,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=21975: Tue Jul  5 16:38:19 2022
  read: IOPS=220k, BW=860MiB/s (902MB/s)(8604MiB/10001msec)
    slat (nsec): min=1686, max=84683, avg=2840.36, stdev=1909.82
    clat (usec): min=7, max=8575, avg=141.98, stdev=84.54
     lat (usec): min=12, max=8587, avg=144.88, stdev=84.62
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   65], 10.00th=[   73], 20.00th=[   84],
     | 30.00th=[   93], 40.00th=[  105], 50.00th=[  121], 60.00th=[  139],
     | 70.00th=[  161], 80.00th=[  192], 90.00th=[  243], 95.00th=[  297],
     | 99.00th=[  424], 99.50th=[  478], 99.90th=[  586], 99.95th=[  644],
     | 99.99th=[  758]
   bw (  KiB/s): min=822312, max=894848, per=49.96%, avg=880937.26, stdev=17669.88, samples=19
   iops        : min=205578, max=223712, avg=220234.42, stdev=4417.45, samples=19
  lat (usec)   : 10=0.01%, 20=0.34%, 50=2.73%, 100=32.93%, 250=54.84%
  lat (usec)   : 500=8.81%, 750=0.34%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=34.75%, sys=59.46%, ctx=111775, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=2202645,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=1722MiB/s (1806MB/s), 860MiB/s-862MiB/s (902MB/s-903MB/s), io=16.8GiB (18.1GB), run=10001-10001msec

Disk stats (read/write):
  nvme0n1: ios=4362977/0, merge=0/0, ticks=537816/0, in_queue=537815, util=99.10%