Log/220713_132513_fio.log
/dev/nvme0n1: (g=0): rw=trim, bs=(R) 4096B-1024KiB, (W) 4096B-1024KiB, (T) 4096B-1024KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=12011: Wed Jul 13 13:25:34 2022
  trim: IOPS=2143, BW=1929MiB/s (2023MB/s)(37.7GiB/20001msec)
    clat (usec): min=261, max=4629, avg=458.02, stdev=92.48
     lat (usec): min=261, max=4630, avg=458.56, stdev=92.55
    clat percentiles (usec):
     |  1.00th=[  326],  5.00th=[  355], 10.00th=[  379], 20.00th=[  388],
     | 30.00th=[  396], 40.00th=[  408], 50.00th=[  437], 60.00th=[  486],
     | 70.00th=[  498], 80.00th=[  523], 90.00th=[  553], 95.00th=[  586],
     | 99.00th=[  816], 99.50th=[  914], 99.90th=[ 1045], 99.95th=[ 1074],
     | 99.99th=[ 1106]
   bw (  MiB/s): min= 1862, max= 1994, per=100.00%, avg=1930.43, stdev=28.74, samples=39
   iops        : min= 2094, max= 2222, avg=2145.69, stdev=30.77, samples=39
  lat (usec)   : 500=72.27%, 750=26.21%, 1000=1.35%
  lat (msec)   : 2=0.17%, 10=0.01%
  cpu          : usr=4.70%, sys=6.25%, ctx=42890, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,0,42881,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   TRIM: bw=1929MiB/s (2023MB/s), 1929MiB/s-1929MiB/s (2023MB/s-2023MB/s), io=37.7GiB (40.5GB), run=20001-20001msec

Disk stats (read/write):
  nvme0n1: ios=51/0, merge=0/0, ticks=9/0, in_queue=18147, util=99.73%